% 参数定义开始
E=2.1e11;  coe=0.9;  G=E/2/(1+0.3);  density=7500;  %轴系--物理参数

n=4;   %桨叶数

L1=1.6;  L2=1.6;  L3=1.6; L4=1.6;  %各桨叶长度 m

b=0.07;  h=0.3;   %桨叶矩形截面宽高

%桨叶弹性模量、密度、铁木辛柯剪切系数
pro_E=4.2e11;  
pro_density=8900+1000;
ue=0.32;

%桨叶极惯性矩系数belta
% ratio=0.281;

% 轴系各跨段长度、直径
L01=0.3;   L02=5;   L03=10;
d1=0.4;  d2=0.36;   d3=0.32;

% 桨毂质量属性
m=1860;
Imu=73;
Imv=85;
Imw=85;   %转动惯量

% 推力轴承处三向刚度
k0u=2.3e8;  %纵向
k0v=8.8e7;
k0w=8.8e7;

% 艉轴承支撑径向刚度,两向值相同
spring1=1.8e8;   %后艉轴承
spring2=1.8e8;   %前艉轴承

%  参数定义结束