% 参数定义开始
E=2.1e11;  coe=0.9;  G=E/2/(1+0.3);  density=7500;  %轴系--物理参数

n=4;   %桨叶数

L1=1.6;  L2=1.6;  L3=1.6; L4=1.6;  %各桨叶长度 m

b=0.12;  h=0.42;   %桨叶矩形截面宽高

%桨叶弹性模量、密度、铁木辛柯剪切系数
pro_E=1.85e11;  
pro_density=8600+1000;
ue=0.32;

%桨叶极惯性矩系数belta
ratio=0.281;

% 轴系各跨段长度、直径
L01=0.8;   L02=4;   L03=8;
d1=0.4;  d2=0.36;   d3=0.32;

% 桨毂质量属性
m=378;
Imu=17;
Imv=9.2;
Imw=9.2;   %转动惯量

% m=756;
% Imu=34;
% Imv=18.4;
% Imw=18.4;   %转动惯量

% 推力轴承处三向刚度
k0u=5.6e8;  %纵向
k0v=4.8e8;
k0w=8.8e8;

% k0u=6.6e7;  %纵向
% k0v=6.8e8;
% k0w=6.8e7;
% 艉轴承支撑径向刚度,两向值相同
spring1=1.8e8;   %后艉轴承
spring2=1.8e8;   %前艉轴承
% spring1=7.8e7;   %后艉轴承
% spring2=7.8e7;   %前艉轴承

%  参数定义结束